---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SplineFailures.ClosedSpline
source: html/0f8f6b8e-3e70-4d39-0072-48032db39c96.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SplineFailures.ClosedSpline Property

Closed or self-intersecting splines are not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId ClosedSpline { get; }
```